src/cf/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <basedOn>Document.ТабельУчётаРабочегоВремени</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ТабельУчётаРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ТарифныеСтавки/ТарифныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифныеСтавки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОклада</name>
    <type>
      <types>EnumRef.ВариантыОклада</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Зарплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Сумма = Объект.ТЧСотрудники.Итог("Сумма");
	СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников();
	Если Не СтрокаУжеРассчитанныхСотрудников = "" Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,СтрокаУжеРассчитанныхСотрудников);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧСотрудникиРассчитатьИтог(Элемент)
	ТекСтр = Элементы.ТЧСотрудники.ТекущиеДанные;
	ТекСтр.Сумма = ТекСтр.Оклад + ТекСтр.Премия + ТекСтр.Прочее;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.ТЧСотрудники.Очистить();
	МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудников(Объект.Дата, Объект.МестоХранения);	
	КэшРасчета = РегистрыНакопления.Зарплата.НовыйКэшРасчетаПремий();
	Для Каждого Сотрудник Из МасСотрудники Цикл 
		ДанныеЗарплаты = РегистрыНакопления.Зарплата.РассчитатьПоСотруднику(Сотрудник, Объект.Дата, КэшРасчета);
		НС = Объект.ТЧСотрудники.Добавить();
		НС.Сотрудник = Сотрудник;
		НС.Оклад = ДанныеЗарплаты.Оклад.Сумма;
		НС.Премия = ДанныеЗарплаты.Премия.Сумма;
		НС.Прочее = ДанныеЗарплаты.Прочее.ВсегоНачислено - ДанныеЗарплаты.Прочее.ВсегоУдержано;
		НС.Сумма = ДанныеЗарплаты.Итого;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СтрокаУжеРассчитанныхСотрудников() 
	СтрокаУжеРассчитанныхСотрудников = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЗарплатыТЧСотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.НачислениеЗарплаты.ТЧСотрудники КАК НачислениеЗарплатыТЧСотрудники
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(НачислениеЗарплатыТЧСотрудники.Ссылка.Дата, МЕСЯЦ) = &Дата
	|	И НачислениеЗарплатыТЧСотрудники.Сотрудник В(&МасСотрудников)
	|	И НЕ НачислениеЗарплатыТЧСотрудники.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеЗарплатыТЧСотрудники.Сотрудник.Наименование";
	Запрос.УстановитьПараметр("Дата",НачалоМесяца(Объект.Дата));
	запрос.УстановитьПараметр("МасСотрудников",Объект.ТЧСотрудники.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Ном = 1;
	Пока Выборка.Следующий() Цикл
		Если СтрокаУжеРассчитанныхСотрудников = "" Тогда
			СтрокаУжеРассчитанныхСотрудников = Нстр("fr = 'Les employés suivants ont déjà un calcul de salaire:'; ru = 'По следующим сотрудникам уже есть расчет зарплаты:'; en = 'There is already a salary calculation for the following employees:'; es = 'Para los siguientes empleados ya hay un cálculo salarial:'") + Символы.ПС;
		Иначе
			СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников + Символы.ПС;
		КонецЕсли;
		Если Ном = 6 Тогда 
			СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников + Нстр("fr = 'et autres'; ru = 'и другие'; en = 'and others'; es = 'y otros'");
			Прервать;
		КонецЕсли;
		СтрокаУжеРассчитанныхСотрудников = СтрокаУжеРассчитанныхСотрудников + Выборка.Сотрудник;
		Ном = Ном + 1;
	КонецЦикла;
	Возврат СтрокаУжеРассчитанныхСотрудников;
КонецФункции

#КонецОбласти
